majenkotech/pic32prog-autotools/src/target.c
    {0x720B053, "MZ0512EFE100",  512,   &family_mz},
    {0x7210053, "MZ0512EFF100",  512,   &family_mz},
    {0x7238053, "MZ0512EFK100",  512,   &family_mz},
    {0x720C053, "MZ1024EFE100", 1024,   &family_mz},
    {0x7211053, "MZ1024EFF100", 1024,   &family_mz},
    {0x7239053, "MZ1024EFK100", 1024,   &family_mz},
    {0x720D053, "MZ1024EFG100", 1024,   &family_mz},
    {0x7212053, "MZ1024EFH100", 1024,   &family_mz},
    {0x723A053, "MZ1024EFM100", 1024,   &family_mz},
    {0x720E053, "MZ2048EFG100", 2048,   &family_mz},
    {0x7213053, "MZ2048EFH100", 2048,   &family_mz},
    {0x723B053, "MZ2048EFM100", 2048,   &family_mz},

    {0x7215053, "MZ0512EFE124",  512,   &family_mz},
    {0x721A053, "MZ0512EFF124",  512,   &family_mz},
    {0x7242053, "MZ0512EFK124",  512,   &family_mz},
    {0x7216053, "MZ1024EFE124", 1024,   &family_mz},
    {0x721B053, "MZ1024EFF124", 1024,   &family_mz},
    {0x7243053, "MZ1024EFK124", 1024,   &family_mz},
    {0x7217053, "MZ1024EFG124", 1024,   &family_mz},
    {0x721C053, "MZ1024EFH124", 1024,   &family_mz},
    {0x7244053, "MZ1024EFM124", 1024,   &family_mz},
    {0x7218053, "MZ2048EFG124", 2048,   &family_mz},
    {0x721D053, "MZ2048EFH124", 2048,   &family_mz},
    {0x7245053, "MZ2048EFM124", 2048,   &family_mz},

    {0x721F053, "MZ0512EFE144",  512,   &family_mz},
    {0x7224053, "MZ0512EFF144",  512,   &family_mz},
    {0x724C053, "MZ0512EFK144",  512,   &family_mz},
    {0x7220053, "MZ1024EFE144", 1024,   &family_mz},
    {0x7225053, "MZ1024EFF144", 1024,   &family_mz},
    {0x724D053, "MZ1024EFK144", 1024,   &family_mz},
    {0x7221053, "MZ1024EFG144", 1024,   &family_mz},
    {0x7226053, "MZ1024EFH144", 1024,   &family_mz},
    {0x724E053, "MZ1024EFM144", 1024,   &family_mz},
    {0x7222053, "MZ2048EFG144", 2048,   &family_mz},
    {0x7227053, "MZ2048EFH144", 2048,   &family_mz},
    {0x724F053, "MZ2048EFM144", 2048,   &family_mz},

    {0x5f69053, "MZ2064DAA288", 2048,   &family_mz},
    {0x5F0C053, "MZ1025DAA169", 1024,   &family_mz},
    {0x5F0D053, "MZ1025DAB169", 1024,   &family_mz},
    {0x5F0F053, "MZ1064DAA169", 1024,   &family_mz},
    {0x5F10053, "MZ1064DAB169", 1024,   &family_mz},
    {0x5F15053, "MZ2025DAA169", 2048,   &family_mz},
    {0x5F16053, "MZ2025DAB169", 2048,   &family_mz},
    {0x5F18053, "MZ2064DAA169", 2048,   &family_mz},
    {0x5F19053, "MZ2064DAB169", 2048,   &family_mz},
    {0x5F42053, "MZ1025DAG169", 1024,   &family_mz},
    {0x5F43053, "MZ1025DAH169", 1024,   &family_mz},
    {0x5F45053, "MZ1064DAG169", 1024,   &family_mz},
    {0x5F46053, "MZ1064DAH169", 1024,   &family_mz},
    {0x5F4B053, "MZ2025DAG169", 2048,   &family_mz},
    {0x5F4C053, "MZ2025DAH169", 2048,   &family_mz},
    {0x5F4E053, "MZ2064DAG169", 2048,   &family_mz},
    {0x5F4F053, "MZ2064DAH169", 2048,   &family_mz},
    {0x5F78053, "MZ1025DAA176", 1024,   &family_mz},
    {0x5F79053, "MZ1025DAB176", 1024,   &family_mz},
    {0x5F7B053, "MZ1064DAA176", 1024,   &family_mz},
    {0x5F7C053, "MZ1064DAB176", 1024,   &family_mz},
    {0x5F81053, "MZ2025DAA176", 2048,   &family_mz},
    {0x5F82053, "MZ2025DAB176", 2048,   &family_mz},
    {0x5F84053, "MZ2064DAA176", 2048,   &family_mz},
    {0x5F85053, "MZ2064DAB176", 2048,   &family_mz},
    {0x5FAE053, "MZ1025DAG176", 1024,   &family_mz},
    {0x5FAF053, "MZ1025DAH176", 1024,   &family_mz},
    {0x5FB1053, "MZ1064DAG176", 1024,   &family_mz},
    {0x5FB2053, "MZ1064DAH176", 1024,   &family_mz},
    {0x5FB7053, "MZ2025DAG176", 2048,   &family_mz},
    {0x5FB8053, "MZ2025DAH176", 2048,   &family_mz},
    {0x5FBA053, "MZ2064DAG176", 2048,   &family_mz},
    {0x5FBB053, "MZ2064DAH176", 2048,   &family_mz},
    {0x5F5D053, "MZ1025DAA288", 1024,   &family_mz},
    {0x5F5E053, "MZ1025DAB288", 1024,   &family_mz},
    {0x5F60053, "MZ1064DAA288", 1024,   &family_mz},
    {0x5F61053, "MZ1064DAB288", 1024,   &family_mz},
    {0x5F66053, "MZ2025DAA288", 2048,   &family_mz},
    {0x5F67053, "MZ2025DAB288", 2048,   &family_mz},
    {0x5F69053, "MZ2064DAA288", 2048,   &family_mz},
    {0x5F6A053, "MZ2064DAB288", 2048,   &family_mz},

    /* USB bootloader */
    {0xEAFB00B, "Bootloader",   0,      &family_bl},
    {0}
};

/*
 * Table of supported serial protocols.
 */
static const struct {
    const char *prefix;
    adapter_t *(*func)(const char *port, int baud);
} serial_tab[] = {
#ifdef ENABLE_STK500V2
    { "stk500",     adapter_open_stk500v2       },  /* Default */
#endif
#ifdef ENABLE_AN1388_UART
    { "an1388",     adapter_open_an1388_uart    },
#endif
#ifdef ENABLE_BITBANG
    { "ascii",      adapter_open_bitbang        },
#endif
    { 0 },
};

/*
 * Table of supported USB protocols.
 */
static const struct {
    const char *prefix;
    adapter_t *(*func)(int vid, int pid, const char *serial, int report);
} usb_tab[] = {
#ifdef ENABLE_PICKIT2
    { "pickit2",    adapter_open_pickit2        },
    { "pickit3",    adapter_open_pickit3        },
#endif
#ifdef ENABLE_HIDBOOT
    { "hidboot",    adapter_open_hidboot        },
#endif
#ifdef ENABLE_AN1388
    { "an1388",     adapter_open_an1388         },
#endif
#ifdef ENABLE_UHB
    { "uhb",        adapter_open_uhb            },
#endif
    { 0 },
};

#if defined(__CYGWIN32__) || defined(MINGW32)
/*
 * Delay in milliseconds: Windows.
 */
#include <windows.h>

void mdelay(unsigned msec)
{
    Sleep(msec);
}

int __ms_vsnprintf(char *str, size_t size, const char *format, va_list ap)
{
    // Needed to link the libusb-win32/libusb-1.0.a library.
    return 0;
}
#else
/*
 * Delay in milliseconds: Unix.
 */
void mdelay(unsigned msec)
{
    usleep(msec * 1000);
}
#endif

/*
 * Open USB adapter, detected by vendor/product ID.
 * Return a pointer to adapter structure, or 0 when not found.
 */
static adapter_t *open_usb_adapter(const char *port_name, int report)
{
    char *delimiter;
    const char *serial = 0;
    int prefix_len, i, vid, pid;

    if (!port_name) {
        /* Autodetect the device from a list of known adapters. */
        adapter_t *a = NULL;
#ifdef ENABLE_PICKIT2
        if (! a)
            a = adapter_open_pickit2(0, 0, 0, report);
        if (! a)
            a = adapter_open_pickit3(0, 0, 0, report);
#endif
#ifdef ENABLE_MPSSE
        if (! a)
            a = adapter_open_mpsse(0, 0, 0, report);
#endif
#ifdef ENABLE_HIDBOOT
        if (! a)
            a = adapter_open_hidboot(0, 0, 0, report);
#endif
#ifdef ENABLE_AN1388
        if (! a)
            a = adapter_open_an1388(0, 0, 0, report);
#endif
#ifdef ENABLE_UHB
        if (! a)
            a = adapter_open_uhb(0, 0, 0, report);
#endif
        return a;
    }

