majenkotech/pic32prog-autotools/src/target.c
    /* Get protocol prefix. */
    delimiter = strchr(port_name, ':');
    if (! delimiter)
        return 0;
    prefix_len = delimiter - port_name;

    /* Find prefix in the protocol table. */
    for (i=0; usb_tab[i].prefix; i++) {
        int len = strlen(usb_tab[i].prefix);
        if (prefix_len == len &&
            strncasecmp(port_name, usb_tab[i].prefix, len) == 0) {
            goto found;
        }
    }
    fprintf(stderr, "%s: Unknown USB protocol\n", port_name);
    return 0;

found:
    vid = strtoul(delimiter+1, &delimiter, 16);
    if (*delimiter != ':') {
        fprintf(stderr, "%s: Incorrect VID:PID value\n", port_name);
        return 0;
    }
    pid = strtoul(delimiter+1, &delimiter, 16);
    if (*delimiter == ':')
        serial = delimiter+1;

    return usb_tab[i].func(vid, pid, serial, report);
}

/*
 * Open serial adapter.
 * Use Arduino-compatible protocol (stk500v2) by default.
 * To select other protocols, add a prefix to the port name,
 * like "bitbang:COM5".
 */
static adapter_t *open_serial_adapter(const char *port_name, int baud_rate)
{
    const char *prefix, *delimiter;
    int prefix_len, len, i;

    /* Get protocol prefix. */
    delimiter = strchr(port_name, ':');
    if (! delimiter) {
        /* Use stk500v2 protocol by default. */
        return serial_tab[0].func(port_name, baud_rate);
    }
    prefix_len = delimiter - port_name;
    prefix = port_name;
    port_name = delimiter + 1;

    /* Find prefix in the protocol table. */
    for (i=0; serial_tab[i].prefix; i++) {
        len = strlen(serial_tab[i].prefix);
        if (prefix_len == len &&
            strncasecmp(prefix, serial_tab[i].prefix, len) == 0) {
            return serial_tab[i].func(port_name, baud_rate);
        }
    }
    return 0;
}

/*
 * Parse the name of the device.
 * Return 1 in case of USB device (0 for serial).
 */
static int is_usb_device(const char *port_name)
{
    const char *delimiter;

    /* No device name specified - search for a known USB device. */
    if (!port_name)
        return 1;

    /* Get protocol prefix. */
    delimiter = strchr(port_name, ':');
    if (!delimiter) {
        /* No protocol prefix - use serial protocol. */
        return 0;
    }

    /* Get VID. */
    delimiter = strchr(delimiter + 1, ':');
    if (!delimiter) {
        /* No VID - assume serial protocol. */
        return 0;
    }

    /* Protocol prefix, VID and PID are present - use USB protocol. */
    return 1;
}

/*
 * Connect to JTAG adapter.
 */
target_t *target_open(const char *port_name, int baud_rate)
{
    target_t *t;

    t = calloc(1, sizeof(target_t));
    if (! t) {
        fprintf(stderr, _("Out of memory\n"));
        exit(-1);
    }
    t->cpu_name = "Unknown";

    /* Update pic2_tab[] array from the pic32prog.conf file. */
    target_configure();

    /* Find adapter. */
    if (open_retries == 0) open_retries = 1;

    if (open_retries > 1) {
        conprintf("\n*** Enter programming mode now. ***\n\n");
        fflush(stdout);
    }

    while(open_retries > 0) {
        if (is_usb_device(port_name)) {
            t->adapter = open_usb_adapter(port_name, open_retries == 1);
        } else {
            t->adapter = open_serial_adapter(port_name, baud_rate);
        }

        if (t->adapter) break;

        open_retries--;
        if (open_retries > 0) {
            usleep(500000);
        }
    }
    if (! t->adapter) {
        fprintf(stderr, "\n");
        fprintf(stderr, _("No target found.\n"));
        exit(-1);
    }

    /* Check CPU identifier. */
    t->cpuid = t->adapter->get_idcode(t->adapter);
    if (t->cpuid == 0) {
        /* Device not responding. */
        fprintf(stderr, _("Unknown CPUID=%08x.\n"), t->cpuid);
        t->adapter->close(t->adapter, 0);
        exit(1);
    }

    unsigned i;
    for (i=0; (t->cpuid ^ pic32_tab[i].devid) & 0x0fffffff; i++) {
        if (pic32_tab[i].devid == 0) {
            /* Device not detected. */
            fprintf(stderr, _("Unknown CPUID=%08x.\n"), t->cpuid);
            t->adapter->close(t->adapter, 0);
            exit(1);
        }
    }
    t->family = pic32_tab[i].family;
    t->cpu_name = pic32_tab[i].name;
    t->flash_addr = 0x1d000000;
    t->flash_bytes = pic32_tab[i].flash_kbytes * 1024;
    if (! t->flash_bytes) {
        t->flash_addr = t->adapter->user_start;
        t->flash_bytes = t->adapter->user_nbytes;
        t->boot_bytes = t->adapter->boot_nbytes;
    }
    t->adapter->family_name = t->family->name;
    return t;
}

/*
 * Close the device.
 */
void target_close(target_t *t, int power_on)
{
    t->adapter->close(t->adapter, power_on);
}

const char *target_cpu_name(target_t *t)
{
    return t->cpu_name;
}

unsigned target_idcode(target_t *t)
{
    return t->cpuid;
}

unsigned target_flash_bytes(target_t *t)
{
    return t->flash_bytes;
}

unsigned target_boot_bytes(target_t *t)
{
    return t->family->boot_kbytes * 1024;
}

unsigned target_devcfg_offset(target_t *t)
{
    return t->family->devcfg_offset;
}

unsigned target_block_size(target_t *t)
{
    return t->family->bytes_per_row;
}

/*
 * Add an entry to the pic32_tab[] array.
 */
void target_add_variant(char *name, unsigned id,
    char *family, unsigned flash_kbytes)
{
    int i;

    for (i=0; i<TABSZ; i++) {
        if (pic32_tab[i].devid == 0 ||
            id == pic32_tab[i].devid) {
            /* Add a new entry or update an existing one
             * with new data from config file. */
            pic32_tab[i].name = strdup(name);
            pic32_tab[i].flash_kbytes = flash_kbytes;
            if (strcmp(family, "MX1") == 0)
                pic32_tab[i].family = &family_mx1;
            else if (strcmp(family, "MX3") == 0)
                pic32_tab[i].family = &family_mx3;
            else if (strcmp(family, "MZ") == 0)
                pic32_tab[i].family = &family_mz;
            else {
                fprintf(stderr, "%s: Unknown family=%s.\n", name, family);
            }
            break;
        }
    }
}

